app/views/profiles/show.html.erb

<ul>
  <% @profile.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."profile_id" = ?  [["profile_id", 1]]