app/controllers/comments_controller.rb

  def new
    @profile = Profile.find(params[:profile_id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @profile = Profile.find(params[:profile_id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]