app/controllers/profiles_controller.rb

  def edit
    @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 1]]